# Pandas - Part 4

## Data Input and Output

There are 4 commonly used data souces
* CSV
* Excel
* HTML
* SQL

In [1]:
import pandas as pd

### * CSV

In [7]:
df = pd.read_csv('example.csv')

In [11]:
# Save to csv, index=False
df.to_csv('My_output.csv', index=False)

### * Excel

In [12]:
# read Excel file
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [13]:
df.to_excel('Excel_Sample_ouput.xlsx', sheet_name='NewSheet')

### * HTML

In [14]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [17]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","December 20, 2017"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","October 20, 2017"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

### * SQL

In [18]:
from sqlalchemy import create_engine

In [19]:
engine = create_engine('sqlite:///:memory:')

In [20]:
df.to_sql('my_table',engine)

In [24]:
sqldf = pd.read_sql('my_table', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15